import React, {Component} from 'react';
import './Improve_information.css'
import {Link, Route} from "react-router-dom";
import {Modal} from "antd";
class Improve_information extends Component {


    arugement=()=>{
        let check=document.getElementById('argue').checked
        if (check){
            this.info()
        }
    }
    info=()=>{
        Modal.info({
            title: '《如新（中国）优惠顾客/星级顾客注册申请书',
            okText:'同意',
            width:'50%',
            content: (
                <div style={{width:'100%',overflowY:'scroll',height:'500px'}}>
                    及en悦家会员点数获取规则》

                    一、欢迎您申请成为如新（中国）优惠顾客/星级顾客

                    1、如果一次性以星级顾客价购买实付单笔金额为500元（含）以上人民币的产品，则在该笔订单交易完成后即可以成为星级顾客。成为星级顾客后可以使用如新（中国）公布的产品的零售价格的8折优惠购买产品。

                    2、星级顾客在成为星级顾客的当月起，后续连续每日历月累计购货实付金额达到500元人民币及以上，才可维持其星级顾客资格。如其星级顾客资格终止，则自其资格终止之日起，其自动变更为优惠顾客。

                    3、如果一次性以零售价购买实付单笔金额为500元（含）以上人民币的产品，则在该笔订单交易完成后即可以成为优惠顾客。优惠顾客可以使用如新（中国）公布的产品的零售价格的9折优惠购买产品。优惠顾客在成为优惠顾客的当月起，后续连续每六个日历月之内至少购买一次如新（中国）产品，才可维持其优惠顾客资格。

                    4、星级顾客于任一日历月累计购货实付金额未满500元，则其星级顾客资格将于次月1日自动终止，并自动变更为优惠顾客不再享受相应的星级顾客优惠。优惠顾客于任一六个日历月内未购买如新（中国）产品，则其优惠顾客资格将于该六个日历月结束后的次月1日自动终止，不再享受相应的优惠。

                    5、星级顾客资格终止后，只需一次性单笔购买实付金额500元（含）以上人民币的产品，即视为重新加入星级顾客。

                    6、优惠顾客和星级顾客购买的所有产品仅限于其个人使用。如新（中国）严禁优惠顾客和星级顾客转售产品。

                    7、优惠顾客和星级顾客同意并接受如新（中国）通过任何方式不时向其发送相关信息。优惠顾客和星级顾客可以根据所接收到信息的退定指引或联系400-004-5678退定如新（中国）发送的相关信息。

                    8、零售顾客以如新（中国）公布的产品的零售价格购买如新（中国）产品，无需经过申请，也无折扣优惠。（如果您愿意了解我们产品的优惠信息，烦请您留下个人联系方式，我们会在第一时间让您知道产品的优惠动态。）

                    9、如新（中国）不向未成年人出售产品，优惠顾客/星级顾客申请仅限年满18周岁及以上的成年人，未成年人的产品只能由成年人购买。

                    10、如星级顾客退回购货订单的任何产品后，订单实付金额仍为500元以上（含500元）星级顾客资格将不会终止。因退货而导致订单实付金额不足500元的，订单生成月当月退货的则其星级顾客资格将于次月1日自动终止，订单生成月次月退货的则星级顾客资格将会即时自动终止。如优惠顾客退回购货订单的产品导致不符合优惠顾客资格，则优惠顾客资格即时自动终止。

                    11、如新（中国）有权单方决定接受或拒绝星级顾客的再次申请。



                    二、en悦家会员点数获取规则

                    如新（中国）优惠顾客、星级顾客通过星享城自购可获得相应en悦家会员点数，该en悦家会员点数可以在星享城购买后续产品时抵扣相应金额，1点数现金价值相当于人民币1元。

                    1、适用对象：本en悦家会员点数获取规则适用于如新（中国）优惠顾客、星级顾客。但不适用如新（中国）直销员、销售员工、准经销商、经销商等事业经营伙伴。

                    2、en悦家会员点数获取：单笔订单实付金额不足500元，不获取任何点数；单笔订单实付金额为500元以上（含500元）即可获得en悦家会员点数，100元/档位，每向上一个档位增加5个点数，当月累计实际消费额达到11000元及以上能够获取的点数封顶，为550点。

                    示例：

                    消费金额

                    获取点数

                    500元-599元

                    25

                    600元-699元

                    30

                    700元-799元

                    35

                    800元-899元

                    40

                    …

                    11000元或以上

                    …

                    550

                    * 除如新（中国）辅销品及指定的其他产品、运费以外，购买其他任意品类均可按以上规则获取相应en悦家会员点数。

                    * 每个月可能获得有效最小点数为25点，最高点数550点。

                    3、en悦家会员点数使用规则：

                    3.1点数抵扣：

                    ? 点数可用于抵扣后续所购买如新（中国）的产品和辅销品。

                    ? 点数至多可抵扣单笔订单实付金额的50%。

                    ? 点数抵扣的除外产品：如新（中国）的新品，促销套装不可使用点数抵扣。

                    *实付金额指扣除上述点数抵扣除外产品所对应金额以及优惠券（现金券，满减券等）、折扣、其他优惠活动所享受的优惠金额之后的付款金额。

                    *如新（中国）享有变更和决定不可使用点数抵扣的产品范围的权利。

                    3.2点数生效期及有效期：

                    ? 每笔订单对应点数在订单次日发放并显示待生效，收货后点数立即生效，点数享有90天使用有效期（至生效日起开始计算），过期清零。

                    3.3点数抵扣的退换货规则：

                    ? 30天无理由退货：退货部分使用的点数公司将如数退还顾客；且公司将收回相应的点数，具体而言：退货后实付金额仍为500元（含）以上的订单会扣除退货部分产品购买产生的点数。退货后实付金额不足500元，则会取消该笔订单产生的所有点数（含该笔订单的未退货部分（如有）所产生的点数）；如账户内剩余点数不足扣除时，差额部分将按照同等现金价值从退款中自行扣除。

                    ? 质量问题产生的退货：公司将退货部分的使用点数退还顾客，且公司将收回该退货部分产品购买产生的点数，如账户内剩余点数不足扣除时，差额部分将按照同等现金价值从退款中自行扣除；

                    ? 产品换货：不论是否产生差价，均不涉及点数变更或退还点数。



                    三、申请人完全理解并接受《如新（中国）顾客政策与程序》（以下简称“顾客政策与程序”）和《如新（中国）优惠顾客/星级顾客申请书及en悦家会员点数获取规则》（以下简称“本规则”），并进一步同意遵守如新（中国）以后不时对顾客政策与程序及本规则所做的增订或修改，并保证所填写资料真实有效、由本人亲自签署且本人填写签署时具有完全民事行为能力、心智健全、认知清晰、能够完全理解自身行为性质及后果。



                    四、如新（中国）保留不定期单方增订、修改顾客政策与程序及本规则的权利并通知顾客，如新（中国）通过官方网站、官方资料、电话、手机短信、微信、电子邮件、各类会议等公示行为视为如新（中国）已经履行通知义务。优惠顾客、星级顾客、事业经营伙伴应经常浏览如新（中国）官方网站，认真阅读、了解如新最新规则。若优惠顾客、星级顾客、事业经营伙伴未于该通知发出后15个工作日内向如新（中国）发出终止本规则的书面申请，则视为优惠顾客、星级顾客、事业经营伙伴完全理解并同意该增订或修订的内容并自愿受其约束。



                    五、如新（中国）有权提前一个月书面通知优惠顾客、星级顾客、事业经营伙伴或以官网公告形式以单方终止本规则的权利。



                    六、联系我们：对任何有关本规则的问题，请联系如新（中国）业务咨询热线400-004-5678。



                    七、本规则自2020年6月1日起生效，如新（中国）在法律允许的范围内对本规则享有最终解释权。因本规则解释、适用以及产品购买行为所产生的纠纷，双方如协商不成，则有权向上海市奉贤区人民法院提起诉讼。



                    如新（中国）顾客政策与程序

                    顾客不得作出任何损害公司名誉、声誉、权益的行为，包括但不限于：

                    1. 伪造或变造与公司有关的文件或假冒公司的名义在该等文件上签名。

                    2. 未经公司授权或批准，擅自制作、销售、发行、传播有关公司的辅销文件、广告、物品。

                    3. 以任何形式扰乱公司办公室、店铺、服务网点或其他与公司相关的活动场所的公共秩序，干扰公司及其事业经营伙伴的正常经营或消费者的购货活动。

                    4. 以伪造的或不真实的资料骗取公司同意其如新（中国）优惠顾客/星级顾客申请。

                    5. 未经公司批准或授权，擅自以任何线上或者线下以及公开或非公开的方式、渠道、媒介、店铺等陈列、宣传、销售、推广公司产品【不论是否低价以及是否可能给公司造成经济、名誉等方面的损失或损害】。

                    6. 销售如新集团海外产品。

                    7. 未经授权，透过任何媒介，包括互联网、报纸、杂志、宣传册等，发布侵权本公司商标、著作权、专利等的广告、文章或其他任何形式的宣传或报导。

                    8. 未经公司批准或授权，就与公司产品或业务有关的话题擅自接受新闻、网站等媒介、出版单位或个人作者的采访。

                    9. 攻击、轻视、诋毁公司、公司员工或事业经营伙伴的声誉。

                    10. 威胁、恐吓或侵害公司、公司员工或事业经营伙伴的人身及财产安全。

                    11. 贿赂公司的员工，以谋取利益。

                    12. 对公司的产品、服务做虚假、夸大不实的声明或宣传。

                    13. 冒用其他人员的名义购货，或将本人的CN账号转让或出借给他人使用。

                    14. 其他涉及违反国家法律、法规、规定或侵犯公司权益的行为。



                    本顾客政策与程序自顾客签署、知晓或应当知晓之日起即对顾客具有约束力，对有任何上述行为的顾客，公司有权自行决定终止其顾客的资格并保留追求其法律责任的权利。终止通知一经以短信方式传送至由顾客提供的手机号码等联系方式，即被视为送达，并自送达之日起生效。如顾客预留的联系方式发生变更的，则应于变更之日起3日内及时向公司发送书面通知或者在系统中自行修改完成，否则视为未作变更。顾客的资格被终止后，其不得再享有任何本公司随时公布的顾客可以享有的优惠政策（包括但不限于以优惠/星级价格、享有点数抵扣等购买本公司的产品）。
                </div>
            ),
            onOk() {},
        });
    }
    nextPage=()=>{
        this.props.history.push('/home/Home')
    }
    render() {
        return (
            <div>
                <div className='BigBox'>
                    <div className='regHeader'>
                        <img src={require('../../assets/images/log.png')} alt=""/>
                        <span>完善信息</span>
                        <div>
                            已有账号？<Link to='/login/Login'>去登录</Link>
                        </div>
                    </div>
                    <div className='regBody'>
                        <form action="">
                            <div>姓名</div>
                            <input type="text" placeholder='请输入您的姓名'/>
                            <div>证件类型</div>
                            <select name="" id="">
                                <option value="">身份证</option>
                                <option value="">护照</option>
                                <option value="">军官证</option>
                            </select>
                            <div>证件号码</div>
                            <input type="text" placeholder='请输入证件号码' className='phone'/>
                            <div>证件号码确认</div>
                            <input type="text" placeholder='请输入证件号码'/>
                            <div>
                                <p>您是如何认识如新(中国)的？(此项为市场调研资料，请填写其中一项)</p>
                                <input type="radio" name='introduce'/>有介绍
                                <input type="radio" name='introduce'/>无介绍
                                <input type="radio" name='introduce'/>其他
                            </div>
                            <div>如新账号</div>
                            <div>
                                <input type="text" value='CN' disabled={true} className='CN'/>
                                <input type="text" placeholder='请输入CN号'/>
                            </div>
                            <div className='argue'>
                                <input type="checkbox" onClick={this.arugement} id='argue'/>
                                <div>同意《如新用户注册协议》</div>
                            </div>
                            <input type="button" value='提交' className='submit' onClick={this.nextPage}/>
                            <input type="submit" value='跳过' onClick={this.nextPage}/> <br/>

                            <Link to='/login/Register' >上一步</Link>
                        </form>
                    </div>
                </div>
            </div>
        )
    }
}

export default Improve_information
