import React, {Component} from 'react';
import './register.css'
import {Link} from "react-router-dom";
import {Modal,Layout} from  'antd'

const { Header, Content, Footer } = Layout;

class Register extends Component {
    state = {
        visible: false,
        content:'获取验证码',
    };
    changeCode=()=>{
        let time=60;
        let that=this;
        if (this.state.content==='获取验证码'){
            setInterval(function () {
                let con='有效时间'+time+'s';
                time--;
                if (time>0){
                    that.setState({
                        content:con
                    })
                }else {
                    that.setState({
                        content:'获取验证码'
                    })
                }
            },1000)
        }

    }
    showModal = () => {
        this.setState({
            visible: true,
        });
    };

    handleOk = e => {
        console.log(e);
        this.setState({
            visible: false,
        });
    };

    handleCancel = e => {
        console.log(e);
        this.setState({
            visible: false,
        });
    };
    arugement=()=>{
        let check=document.getElementById('argue').checked
        if (check){
            this.info()
        }
    }
    back=()=>{
        this.props.history.push('/login/Login')
    }
    info=()=>{
        Modal.info({
            title: '如新用户注册协议、如新隐私政策',
            okText:'同意',
            width:'50%',
            content: (
                <div style={{width:'100%',overflowY:'scroll',height:'500px'}}>
                    在您注册成为如新（中国）日用保健品有限公司（以下简称如新）用户及或优惠顾客/星级顾客的过程中，您需要完成如新的注册流程并通过点击同意的形式在线签署《如新用户注册协议》、《如新隐私政策》，本隐私政策明确了我们的产品与/或服务所收集、使用及共享个人信息的类型方式和用途。请您务必仔细阅读、充分理解协议中的条款内容后再点击同意（尤其是以粗体并下划线标识的条款，因为这些条款可能会明确您应履行的义务或对您的权利有所限制）：



                    <br/>【审慎阅读】您在申请注册流程中点击同意前，应当认真阅读以下协议。请您务必审慎阅读、充分理解协议中相关条款内容，其中包括：

                    <br/>1、与您约定免除或限制责任的条款；

                    <br/>2、与您约定法律适用和管辖的条款；

                    <br/>3、其他以粗体下划线标识的重要条款。



                    <br/>【请您注意】如果您不同意上述协议或其中任何条款约定，请您停止注册。您停止注册后将仅可以浏览我们的产品信息但无法享受我们的产品或服务。如您按照注册流程提示填写信息、阅读并点击同意上述协议且完成全部注册流程后，即表示您已充分阅读、理解并接受协议的全部内容；并表明您也同意如新可以依据以上的隐私政策内容来处理您的个人信息，并同意我们将您的订单信息共享给为完成此订单所必须的第三方合作方。如您对协议有任何疑问，可向我们的客服咨询。



                    <br/>《如新用户注册协议》

                    <br/>本协议是您与如新网站（简称本站，网址：https://china.nuskin.com/）所有者（以下简称为如新）之间就如新网站服务等相关事宜所订立的契约，请您仔细阅读本注册协议，您点击同意并继续按钮后，本协议即构成对双方有约束力的法律文件。

                    <br/>第1条 本站服务条款的确认和接纳

                    <br/> 1.1本站的各项电子服务的所有权和运作权归如新所有。用户同意所有注册协议条款并完成注册程序，才能成为本站的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。

                    <br/> 1.2用户点击同意本协议的，即视为用户确认自己具有享受本站服务、下单购物等相应的权利能力和行为能力，能够独立承担法律责任。

                    <br/> 1.3如果您在18周岁以下，您只能在父母或监护人的监护参与下才能使用本站。

                    <br/>   1.4本协议项下的用户是指在如新网站注册的零售顾客、优惠顾客、星级顾客或及拥有如新账号并另行与如新签订合同的如新事业经营伙伴（包括但不限于如新直销员，如新销售员工，如新准经销商、如新经销商等）。

                    <br/>  1.5如新保留依据中华人民共和国之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。



                    <br/> 第2条 本站服务

                    <br/>  2.1如新通过互联网依法为用户提供互联网信息等服务，用户在完全同意本协议及本站规定的情况下，方有权使用本站的相关服务。

                    <br/> 2.2用户必须自行准备如下设备并承担如下开支：（1）上网设备，包括但不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；（2）上网开支，包括但不限于网络接入费、上网设备租用费、手机流量费等。



                    <br/>第3条 用户信息

                    <br/> 3.1用户应自行诚信向本站提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且如新保留终止用户使用如新各项服务的权利。

                    <br/>  3.2用户在本站进行浏览、下单购物等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。

                    <br/> 3.3用户注册成功后，将产生用户名和密码等账户信息，您可以根据本站规定改变您的密码。用户应谨慎合理的保存、使用其用户名和密码。用户应妥善保存自己的如新账号及密码，不得随意向外透露。通过如新账号及密码登陆进行的相关操作，均视为用户本人操作。如因用户自身原因导致密码遗失或泄漏等情况，产生的相关损失将由用户自行承担。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本站并向公安机关报案。

                    <br/> 3.4用户同意，如新拥有通过邮件、短信电话等形式，向在本站注册、购物用户、收货人发送订单信息、促销活动等告知信息的权利。

                    <br/>3.5用户同意，如新有权使用用户的注册信息、用户名等信息，进行证据保全，包括但不限于公证、见证等。



                    <br/>第4条 用户政策与程序及依法言行义务

                    <br/> 4.1用户不得作出任何损害如新名誉、声誉、权益的行为，包括但不限于：

                    <br/> （1）伪造或变造与如新有关的文件或假冒如新的名义在该等文件上签名。

                    <br/> （2）未经如新授权或批准，擅自制作、销售、发行、传播有关如新的辅销文件、广告、物品。

                    <br/>（3）以任何形式扰乱如新办公室、店铺、服务网点或其他与如新相关的活动场所的公共秩序，干扰如新及其事业经营伙伴的正常经营或消费者的购货活动。

                    <br/>（4）以伪造的或不真实的资料骗取如新同意其注册成为如新用户。

                    <br/> （5）擅自利用媒体包括互联网、出版物或透过其他公共信息渠道销售、推广如新产品（不论是否低价销售）。

                    <br/> （6）擅自开设零售店铺，陈列、销售、推广如新产品（不论是否低价销售）。

                    <br/> （7）销售如新集团海外产品。

                    <br/>（8）未经授权，透过任何媒介，包括互联网、报纸、杂志、宣传册等，发布侵权如新商标、著作权、专利等的广告、文章或其他任何形式的宣传或报导。

                    <br/>（9）未经如新批准或授权，就与如新产品或业务有关的话题擅自接受新闻、网站等媒介、出版单位或个人作者的采访。

                    <br/> （10）攻击、轻视、诋毁如新、如新员工或事业经营伙伴的声誉。

                    <br/>（11）威胁、恐吓或侵害如新、如新员工或事业经营伙伴的人身及财产安全。

                    <br/>（12）贿赂如新的员工，以谋取利益。

                    <br/>（13）对如新的产品、服务做虚假、夸大不实的声明或宣传。

                    <br/>（14）冒用其他人员的名义购货，或将本人的用户权益转让或出借给他人使用。

                    <br/> （15）其他涉及违反国家法律、法规、规定或侵犯如新权益的行为。

                    <br/>  4.2本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：

                    <br/>  （1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论。

                    <br/>   （2）从中国大陆向境外传输资料信息时必须符合中国有关法规。

                    <br/> （3）不得利用本站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动。

                    <br/>  （4）不得干扰本站的正常运转，不得侵入本站及国家计算机信息系统。

                    <br/> （5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料。

                    <br/>  （6）不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论。

                    <br/>（7）不得教唆他人从事本条所禁止的行为。

                    <br/>  （8）不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容。

                    <br/>用户应不时关注并遵守本站不时公布或修改的各类合法规则规定。

                    <br/> 本站保有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。

                    <br/>  若用户未遵守以上规定的，本站有权作出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。



                    <br/> 第5条 产品信息

                    <br/>  本站上的产品价格、数量、是否有货等产品信息随时都有可能发生变动，本站不作特别通知。本站会尽最大努力保证用户所浏览产品信息的准确性，但由于众所周知的互联网技术因素等客观原因存在，本站网页显示的信息可能会有一定的滞后性或差错，对此情形您知悉并理解，如新欢迎纠错。



                    <br/>  第6条 订单

                    <br/> 6.1在您下订单时，请您仔细确认所购产品的名称、价格、数量、型号、规格、尺寸、联系地址、电话、收货人等信息。收货人与用户本人不一致的，收货人的行为和意思表示视为用户的行为和意思表示，用户应对收货人的行为及意思表示的法律后果承担连带责任。



                    <br/>第7条 配送

                    <br/> 7.1本站将会把产品（货物）送到您所指定的收货地址，所有在本站上列出的送货时间为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。

                    <br/> 7.2因如下情况造成订单延迟或无法配送等，本站不承担延迟配送的责任：

                    <br/>（1）用户提供的信息错误、地址不详细等原因导致的；

                    <br/>  （2）货物送达后无人签收，导致无法配送或延迟配送的；

                    <br/>  （3）情势变更因素导致的；

                    <br/>  （4）不可抗力因素导致的，例如：自然灾害、交通戒严、突发战争等。



                    <br/>第8条 所有权、知识产权条款及如新经验共享资料授权许可使用书

                    <br/>  8.1用户一旦接受本协议，即表明该用户主动将其在任何时间段在本站发表的任何形式的信息内容（包括但不限于用户评价、用户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给如新所有，用户同意如新有权就任何主体侵权而单独提起诉讼。

                    <br/>   8.2用户一旦接受本协议，即表明该用户自愿参与如新公司（定义见下）举办的活动及/或分享如新公司的产品使用体会、经验、从事如新事业的经验，并自愿于如新公司举办的活动中提供演讲、发言、现场交流、幻灯片展示等（以下简称“经验共享”）。“如新公司”指如新（中国）日用保健品有限公司、美国如新企业香港分公司、美商如新华茂股份有限公司台湾分公司及其等的关联公司(包括但不限于NU SKIN INTERNATIONAL, INC)。用户同意根据如新公司的要求提供本人的经验共享数据，范围包括但不限于本人姓名、性别、年龄、身高体重、本人照片等个人资料、本人为经验共享而提供或形成的文稿、采访稿、录像、录音及摄影摄像文件、与本人相关的研究记录和调查报告等，无论上述数据是以电子稿或其他有形或无形媒介的形式保存或展现(以下简称“本人的经验共享资料”)。用户认可并同意：

                    <br/> （1）用户在此授权如新公司为实现相关目的，包括展示、发布、促销、广告、出版和销售等，无偿地收集、使用及披露所有用户的经验共享数据，上述使用及披露方式或形式包括公开、复制、抄录、发行、上载、下载、传播、播放、编辑、改编（包括与其他数据结合）、出版、录音、修改、再使用、再版、重录、翻译、销售、赠予等; 如新公司并可转送用户的经验共享资料到如新公司委托的第三方（包括但不限于处理电子科技相关业务的公司及其雇员），允许在该第三方承诺保密本人的经验共享数据下更新、储存及处理用户的经验共享资料，以完成如新公司上述的目的。用户也同意如新公司可为内部行政目的而收集及使用用户的联络方式的个人资料。用户同意如新公司得将用户的个人资料及经验共享数据传输至中国大陆、台湾及香港以外地区。

                    <br/> （2）放弃对如新公司使用用户经验共享数据而产生的包括但不限于因姓名权、隐私权、肖像权、版权、著作权而引起的任何要求、索赔、补偿和请求。

                    <br/>  （3）用户担保本人所提供的所有经验共享数据均为真实、合法及有效。如用户数据有所变更，请立即通知如新公司，否则，用户了解将可能无法获得如新公司提供之相关权益保障。若用户提供的数据存在虚假、非法、欺诈等情况，如新公司有权向用户追究法律责任。若因用户提供的数据存在虚假、非法、欺诈或侵犯第三方合法权益的情形导致如新公司受到职权部门处罚或被第三方追究责任或任何损失的，如新公司有权向用户追索所承担的责任和受到的损失。

                    <br/> （4）用户对所提供之个人资料，依法具有查询或请求阅览、绘制复制本、补充、更正或删除之权。

                    <br/> （5）用户在此保证：如用户擅自冒用他人的信息、照片等数据进行经验共享，用户将依法承担所有由此而造成的法律责任，包括但不限于因侵害他人姓名权、隐私权、肖像权而产生的对第三方的侵权责任。特别地，用户还将承担如新公司为了消除或减少该等冒用他人数据行为所造成对他人以及如新公司本身的不良影响所支付的所有费用。

                    <br/>  （6）用户的经验共享资料不存在任何不真实不合法的情形，否则用户愿承担资料不真实不合法引起的任何法律责任和赔偿责任。

                    <br/>  （7）用户明白及同意如新公司并无义务对用户的经验共享资料作任何宣传、广告或出售。用户同意如新公司保留基于任何因用户的经验共享资料而产出的任何著作权利。

                    <br/>  （8）用户明白用户可能因此经验共享活动而知悉有关如新公司之未公开信息及其他营业秘密或机密数据，用户承诺会对上述信息及数据保密，并且不会在未有如新公司的书面授权情况下使用、交付、告知或提供给第三人，否则用户会赔偿如新公司所受损失。此条款于本授权许可使用书届满、解除或终止后仍生效。

                    <br/>（9）用户已达法定年龄并具有完全民事行为能力。用户已仔细阅读并完全理解本授权许可使用书的内容。

                    <br/> 8.3本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权等权利转让书面协议，其效力及于用户在如新网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。

                    <br/> 8.4用户同意并已充分了解本协议的条款，承诺不将已发表于本站的信息，以任何形式发布或授权其它主体以任何方式使用（包括但不限于在各类网站、媒体上使用）。

                    <br/> 8.5如新是本站的制作者，拥有此网站内容及资源的著作权等合法权利，受国家法律保护，有权不时地对本协议及本站的内容进行修改，并在本站张贴，无须另行通知用户。在法律允许的最大限度范围内，如新对本协议及本站内容拥有解释权。

                    <br/> 8.6除法律另有强制性规定外，未经如新明确的特别书面许可，任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本站的信息内容，否则，如新有权追究其法律责任。

                    <br/> 8.7本站所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是如新或其内容提供者的财产，受中国和国际版权法的保护。本站上所有内容的汇编是如新的排他财产，受中国和国际版权法的保护。本站上所有软件都是如新或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。



                    <br/>第9条 责任限制及不承诺担保

                    <br/>  除非另有明确的书面说明，本站及其所包含的或以其它方式通过本站提供给您的全部信息、内容、材料、产品和服务，均是现状和按现有基础上提供的。

                    <br/> 除非另有明确的书面说明，如新不对本站的运营及其包含在本网站上的信息、内容、材料、产品或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。

                    <br/> 如新不担保本站所包含的或以其它方式通过本站提供给您的全部信息、内容、材料、产品和服务、其服务器或从本站发出的电子信件、信息没有病毒或其他有害成分。

                    <br/>如因不可抗力或其它本站无法控制的原因使本站销售系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，如新会合理地尽力协助处理善后事宜。



                    <br/>第10条 协议更新及用户关注义务

                    <br/> 根据国家法律法规变化及网站运营需要，如新有权对本协议条款不时地进行修改，修改后的协议一旦被张贴在本站上即生效，并代替原来的协议。用户可随时登录查阅最新协议。

                    <br/> 用户有义务不时关注并阅读最新版的协议及网站公告。如用户不同意更新后的协议，可以且应立即停止接受如新网站依据本协议提供的服务；如用户继续使用本网站提供的服务的，即视为同意更新后的协议。如新建议您在使用本站之前阅读本协议及本站的公告。

                    <br/> 如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。



                    <br/> 第11条 法律管辖和适用

                    <br/>  本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国适用之有效法律。

                    <br/> 如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。

                    <br/> 如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向协议签订地人民法院提起诉讼。本协议签订地为中华人民共和国上海市奉贤区人民法院。



                    <br/> 第12条 其他

                    <br/> 12.1如新网站所有者是指在政府部门依法许可或备案的如新网站经营主体。

                    <br/>12.2如新尊重用户和消费者的合法权利，本协议及本网站上发布的各类规则、声明等其他内容，均是为了更好的、更加便利的为用户和消费者提供服务。本站欢迎用户和社会各界提出意见和建议，如新将虚心接受并适时修改本协议及本站上的各类规则。

                    <br/> 12.3本协议内容中以加粗、下划线等方式显著标识的条款，请用户着重阅读。

                    <br/> 12.4您点击本协议下方同意并继续按钮即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。

                    <br/> 《隐私政策》

                    <br/> 1.   概述
                    <br/> 如新郑重承诺尊重并保护您的隐私。我们会严格按照开展经营所在的市场所适用的各类隐私和数据保护法律之要求开展工作。

                    <br/> 本隐私政策阐述了我们如何采集、使用和分享与顾客、事业经营伙伴、求职者、办公场所来访者以及网络访问者（统称为“您”和“您的”）有关的个人数据，并解释了您享有的、与自身的个人数据的使用有关的权利。需要注意的是，并非全部章节均与您同等相关或者对您同等适用，具体的相关性应视您的情况确定。例如，由于我们一般不向办公场所来访者发送营销推广信息，因此如果您是办公场所来访者，那么第10节《您对营销推广的选择》原则上就不适用于您。

                    <br/>请您在使用我们的网站或应用程序，以及/或者向我们提供您的个人数据之前，务必认真阅读本隐私政策。

                    <br/>  2.   公司简介与联系方式
                    <br/> 如新企业有限公司及其附属机构和子公司（“如新”、“我们”、“我方”以及“我们的”）是一家国际集团公司，通过（i）如新网站（当地或全球）（分别称之为“网站”）、（ii）如新应用程序和工具（“应用程序”）以及（iii）事业经营伙伴，提供个人护理产品、营养补充品、仪器及其他商品或服务。

                    <br/> 您的个人数据，将依据您的身份由如新的不同实体且/或针对不同的目的来处理。点击这里查看作为数据的控管方来负责处理您的个人数据的如新实体名单。若您有任何相关问题或疑虑，或者需要更新您的个人数据或行使您的下述权利，敬请联系隐私团队或者我们的数据保护官【DPOoffice@nuskin.com】。

                    <br/> 3.   我们采集哪些个人数据
                    <br/>个人数据是任何与身份已明确或者可明确的生命个体或者（在适当情况下）法人实体直接或间接相关的信息。个人数据可包括名称或姓名、（电邮）地址、电话号码、IP地址、信用卡信息、偏好、年龄、性别、职业等。

                    <br/> 我们采集的个人数据以及对其进行采集的方法取决于您与我们互动的方式。举例来说，如果您是我们的顾客，那么我们采集的数据类型就与您是事业经营伙伴时有所不同。下面概要介绍了我们的数据采集和处理活动。但是，如果您需要了解与具体互动有关的数据处理活动以及处理目的，请点击这里，查阅《如何使用您的个人数据》清单。该清单按照数据主体类别详细列出了各项处理活动。

                    <br/>a.  个人数据的种类
                    <br/> 我们采集的个人数据总体类别如下：

                    <br/>  -          联系信息：如姓名或名称、头衔、地址、电邮地址和电话号码；

                    <br/>  -          履历信息：如性别、生日、国籍，以及载有您的形象、职业和家庭生活（包括家人、子女、兴趣爱好）信息的照片或视频（不包括特殊类别的数据）；

                    <br/> -          身份信息：如护照号、永久居民身份证号、社会保险号及其他任何身份资料和文件，以及上述身份文件的复印件（在适用法律许可的范围内）；

                    <br/>-          登记数据：如业务通讯申请、活动/奖励旅游登记、订阅、下载以及用户名/密码、注册或登记表中要求填写的数据以及反馈和调查答复等相关信息；

                    <br/> -          账务与财务信息：如银行账户资料、信用卡/借记卡资料、银行对账单副本以及为了验证和/或处理支付交易而需要的信息或数据；

                    <br/>-          产品信息：如您的购买历史、以及关于我们向您出售的产品、退货、首选产品的详细信息；

                    <br/> -          特殊类别的个人数据：在特定情况下，我们可能采集特殊类别的个人数据，如与种族或民族本源或您的健康相关的数据；

                    <br/> -          监控录像，在您到访我们的办公场所时可据以识别您的身份；

                    <br/> -          您对如新IT系统和设备的使用情况，仅限于您是事业经营伙伴的情况；

                    <br/> -          其他数据：您自愿提供给我们的其他任何个人数据。例如，在您填写的在线表格中包含专用栏目时，或者当您联系我们的客户服务部门时，您可能会选择向我们提供您家人的个人数据。

                    <br/> b.  向您采集的个人数据以及采集这些数据的原因
                    <br/> 我们采用如下方式直接向您采集个人数据：

                    <br/> I.            作为顾客：

                    <br/>-          在您创建如新账户时，我们将采集或者要求您提供联系信息、部分履历信息及其他相关信息，以及您首选的沟通方式；

                    <br/>-          在您购买如新产品或服务或者退货时，我们将采集或者要求您提供联系信息、账务和财务信息及其他相关信息；

                    <br/>-          在您订阅推广信息和/或登入在线服务时，我们将采集或者要求您提供联系信息及其他相关信息，其中包括登记数据，以及您首选的沟通方式；以及

                    <br/>-          在您以其他方式与如新互动时，例如联系我们的客户服务部门时。在这种情况下，我们将采集您主动向我们提供的个人数据，以及我们为帮助您完成查询而需要的任何个人数据。若您致电我们的呼叫中心，那么我们会对通话进行录音。



                    <br/>II.            作为事业经营伙伴：

                    <br/> -          在您注册成为如新事业经营伙伴时，我们将采集或者要求您提供财务和业务信息及其他相关信息，其中可包括身份信息和其他履历信息；

                    <br/> -          在您购买如新产品或服务或者退货时，我们将采集或者要求您提供联系信息、账务和财务信息及其他相关信息；

                    <br/> -          在您进行业务通讯和/或在线服务登记时，我们将采集或者要求您提供联系信息及其他相关信息，其中包括登记数据，以及您首选的沟通方式；

                    <br/>  -          在您报名参加我们的活动/奖励旅游时，我们将采集或者要求您提供您及受邀嘉宾的联系方式及身份信息，以及包括履历信息、登记数据、账务和财务信息在内的其他相关信息；

                    <br/>  -          在您以事业经营伙伴身份登录并使用我们的某些应用程序时，我们还将要求您提供与这些应用程序相关的信息。在必要情况下，这些信息可包括民族和健康数据，以便我们向您提供所申请的应用程序功能。

                    <br/> -          在您报告负面事件时，我们将采集或者要求您提供联系信息，以及与您遭受的负面事件相关的信息，其中可包含健康数据；

                    <br/>  -          在您使用我们的公司IT系统或者设备时，我们可采集与您使用此类设备相关的数据；以及

                    <br/> -          在您以其他方式与如新互动时，例如通过各种沟通渠道联系我们时。在这种情况下，我们将采集您主动向我们提供的个人数据，以及我们为帮助您完成查询而需要的任何个人数据。若您致电我们的呼叫中心，那么我们会对通话进行录音。



                    <br/>  III.            作为求职者：



                    <br/>   -          在您向我们求职时，我们将要求您提供与求职申请相关的信息，例如您的姓名、联系资料、从业经历和教育背景。我们可要求您通过招聘系统（可阅览详细的隐私通告）进行申请；

                    <br/>   -          在您以其他方式与如新互动时，例如通过各种沟通渠道联系我们时。在这种情况下，我们将采集您主动向我们提供的个人数据，以及我们为帮助您完成查询而需要的任何个人数据。若您致电我们的呼叫中心，那么我们会对通话进行录音。



                    <br/>  IV.            作为办公场所来访者：



                    <br/> -          在您申请访问我们的场所时，我们可采集所需信息（例如您的姓名以及您的公司名称）来识别您的身份并完成必要的安全检查。我们还可采集一些可据以识别您的身份的监控录像。



                    <br/>  V.            作为网络访问者：



                    <br/>  -          在您访问我们的网站或使用我们的应用程序时，我们会自动采集、存储并使用相关技术信息（“通用信息”），其内容包括您的设备，以及您与我们的网站和应用程序的互动。该通用信息将采用多种cookies及其他技术方式从您的计算机或者个人设备发送给我们。部分web浏览器可能会向与之通讯的网站发送“请勿追踪”信号。  目前我们的网站对此类“请勿追踪”信号不予响应。

                    <br/> 请点击【这里】，进一步了解我们对cookies的使用情况以及cookies的禁用方式。

                    <br/> 您不是必须向我们提供个人数据。但是，如果您选择不向我们提供个人数据，那么我们可能无法达到上述目的。

                    <br/>  c.  您的义务
                    <br/>我们希望您仅向我们传达与您本人有关的个人数据。如果您还向我们传达与他人有关的个人数据，则您必须确保在向我们提供此类信息时符合相关法律的规定，并且允许我们在必要情况下使用、处理和转让该等信息。具体而言，在遵从当地适用法律的前提下，如果您使用并非发放给您的信用卡，则您须确认持卡人已经认可您使用其信用卡购物，并且同意如新出于处理您的购物之目的而采集、使用和披露其个人数据。

                    <br/>我们还希望您向我们传达的个人数据均正确无误，并且如果您的个人数据需要更新，则您会及时告知我们。

                    <br/>  d.  从第三方处获取的个人数据
                    <br/>  我们采集的与您相关的个人数据多数都是由您直接提供给我们的信息。在某些情况下，我们还可从以下来源接收与您相关的个人数据:

                    <br/> -          事业经营伙伴；

                    <br/> -          向我们提供您的个人数据的个人（例如您的家人）；

                    <br/> -          监管机构；

                    <br/>  -          其他向我们提供服务的公司。

                    <br/> 这些第三方来源中有部分来源可包括公开信息来源。

                    <br/>e.     未成年人
                    <br/>如新不向未成年人出售产品或服务，如新中国也不允许未满22周岁的人士成为如新的事业经营伙伴。

                    <br/> 如新未成年人产品只能由成年人购买。如您尚未成年，则只能在家长或监护人的参与下使用我们的网站。

                    <br/>我们不会故意采集或以其他方式处理那些来自13岁以下的未成年人的个人数据，并且不会面向16岁以下的未成年人提供服务、网站或者应用程序。如您认为由您监护或看管的未成年人向我们提供了个人数据，则我们强烈建议您立即与我们联系，届时我们将与您共同找出补救办法。

                    <br/>  我们鼓励您参与子女的互联网体验，并在每位子女上网之前与之一起查阅重要的安全技巧。

                    <br/> 如您为子女报名参加如新的活动或奖励旅游，则我们将针对参加该活动或奖励旅游之目的来处理您的子女的个人数据。如该活动要求处理您的子女的特殊类别数据，则我们会征得您的明确许可。

                    <br/>4.   个人数据的使用方式
                    <br/> 在适用法律允许的情况下，我们基于以下法律依据处理您的个人数据：(i)为了履行我们在与您达成的合同项下的义务，或者为了在与您达成合同之前采取措施；(ii)为了履行法律义务；(iii)当使用您的个人数据符合我们的正当商业权益时；或者(iv)基于您的许可。我们的正当权益包括经营、评估和改进自身组织；防范（并防止我们及他人遭受或承担）欺诈、未授权交易、索赔和其他责任；以及确保遵守公司政策及行业标准。对于如新这样开展全球业务经营的公司，出于内部行政管理目的处理您的个人数据一般也被视为正当权益。按照法律规定，我们在自身的正当商业权益与您的数据保护权利之间进行了精心的均衡。如需进一步了解该项均衡测试事宜，敬请联系隐私团队。

                    <br/>我们对您的个人数据的使用取决于您的身份以及您与我们互动的方式。请点击这里查看我们对您的个人数据的使用方式，以及我们采用该等方式的依据。

                    <br/>我们仅在例外情况下且有相应的法律依据时（例如得到您的明确许可）才会处理特殊类别的个人数据（例如种族或民族；健康相关数据）。

                    <br/>如果您对我们如何采集和使用您的个人数据存在疑问，敬请联系隐私团队。

                    <br/> 5.   个人数据的共享和转移
                    <br/> a.  共享个人数据
                    <br/>我们可向以下各方披露您的个人数据：

                    <br/>  -          其他如新实体，其中包括如新实体的董事、员工、代理和代表，但其目的仅限于经营、管理、行政、监督或评估、教育。您可从这里查阅那些可以接收您的数据的如新实体的名单，从这里以及上文的第4和第5节可以查阅数据处理目的和类别的清单；

                    <br/> -          律师、审计师、财务顾问及其他第三方服务提供商，但数据披露须与这些提供商向如新提供的服务相关。

                    <br/> -          供应商和服务提供商，其中包括但不限于发货和交货服务提供商、电信服务提供商、支付服务提供商、活动组织者、旅行社和保险公司；

                    <br/> -          在如新将其全部或者部分资产出售给第三方，或者与第三方合并或被第三方收购时，可向该第三方披露您的个人数据；

                    <br/>-          依照法律、法规、规章制度、法律程序或诉讼，如新被迫、被要求或者被允许向其披露数据的任何适用的监管、法定、政府或其他相关主管部门、机关或团体和行业监管方以及其他任何人。

                    <br/>-          可依照具备相应管辖权的法院所发出的命令或者同等的法律程序，向任何人披露您的个人数据。

                    <br/> 此外，如果您是如新的事业经营伙伴或者顾客，则我们在认定为了确保特定的业务支持或者出于事业经营伙伴教育目的而有必要的情况下，可将您的个人数据转移给为您提供服务的事业经营伙伴和/或推荐人。

                    <br/>在此类情况下，我们将采取合理措施来确保任何第三方接收人均实施了合理的安全机制来保护您的个人数据。

                    <br/>我们不会针对第三方自身的直销目的而向第三方披露您的个人信息。

                    <br/>b.  转移个人数据
                    <br/> 必要时，我们会出于本隐私政策所述目的，将个人数据转移到其他国家或地区，其中包括与最初采集个人数据所在地的保护水平不同的国家或地区。例如，我们可因为母公司位于美国而将您的数据转移到美国。

                    <br/> 在将您的个人数据转移到其他国家或地区时，我们将按照本隐私政策所述并遵照适用法律的规定保护这些数据。在适用法律有要求的情况下，我们将与数据接收人达成有约束力的合同义务，以维护您的数据保护权利。此外，我们还将在适用法律有要求的情况下向相应的监督主管部门通报数据转移情况和/或数据转移机制。

                    <br/> 对于从欧洲经济区（“EEA”）向美国和其他非EEA辖区进行的转移，我们将依照《欧盟一般数据保护条例》（General Data Protection Regulation）第46和49条的要求或者许可，通过实施欧委会批准的标准合同条款以及其他适当的解决方案来解决跨境转移问题。  如果您对个人数据转移过程中采取的数据保护措施（以及如何取得此类措施的拷贝或者如何查阅这些措施）存在疑问，敬请联系隐私团队。

                    <br/>6.   个人数据的保护方式
                    <br/>我们将妥善保护您的个人数据，并通过实施物理（如安全的档案柜）、技术和组织安全措施来防止数据遭受擅自或非法处理或意外丢失、损毁。

                    <br/>具体而言，我们采用行业标准防火墙和密码保护系统来保护自身所运行的数据网络。我们还采用安全传输层协议（TLS）来保护个人数据的传送。对于获得授权的个人，只有在其出于正当商业目的访问此类信息时，我们才会向其提供相应的访问权限。

                    <br/>此外，对个人数据的访问仅限于员工和服务提供商，并且仅限确需知悉的情况。

                    <br/>虽然我们始终努力保护自身的系统、网站、经营和信息，全力防止其遭受擅自访问、使用、修改和披露，但由于互联网作为开放式全球通讯工具而固有的属性，再加上其他若干风险因素，我们无法保证某一信息在传送期间或在我方系统中存储时，绝对不受他方侵扰。

                    <br/>如果您对个人数据的保护方式存在疑问，敬请联系隐私团队。

                    <br/>7.   个人数据的留存时间
                    <br/>为了达到上文“向您采集的个人数据以及采集这些数据的原因”中列出的处理目的，我们将在必需的时限内保留您的个人数据。举例来说，在我们的（合同）关系终止时，除非适用法律允许或者要求，否则我们将不再存储您的个人数据。

                    <br/> 8.   您对自身的个人数据享有的权利
                    <br/>您在我们如何使用和保管您的个人数据方面享有一定的权利。其中包括：

                    <br/> -          更正权。对于我们处理的与您相关的任何不完整或不准确的个人数据，您有权要求予以更正；

                    <br/> -          删除权。对于我们处理的与您相关的个人数据，在特定条件下，您有权要求我们予以删除；

                    <br/>-          撤销同意权。如您业已同意我们处理您的个人数据，则您有权随时撤销自身的同意。但那些在撤销前根据您的同意进行的处理，其合法性不受影响。这包括您希望不再从我方接收营销推广信息的情形；

                    <br/> -          访问权。除某些例外情况之外，对于我们处理的与您相关的个人数据，您有权予以访问并索取其副本。在适用法律允许的情况下，我们将采用电子形式和/或书面或者口头向您提供该等数据。在适用法律许可的情况下，对于此类访问申请，我们可向您收取合理的费用。

                    <br/> 此外，您如果处于EEA，则还拥有以下权利：

                    <br/> -          限制权。在特定条件下，您有权要求我们不得无限制地对您的个人数据进行处理（这一点在您处于澳门时也适用）；

                    <br/> -          可携权。对于我们持有的与您相关的个人数据，在特定条件下，您有权要求我们将其发送给您或者其他数据控管方；

                    <br/> -          反对权。在我们以自身的正当权益作为处理您的个人数据的法律依据时，您有权根据自身的具体情况来拒绝此类处理。  我们除非具有正当依据证明我们不得不超越您的权益进行该等处理，或者需要继续处理该等数据以确立、行使法律主张或对法律主张进行辩护，否则都将遵从您的要求。

                    <br/>  我们在出于直销（包括在直销限度内进行客户剖析）目的处理您的个人数据时，您有权随时对该处理提出反对。如您反对出于直销目的之数据处理，则我们不会再针对此类目的来处理您的个人数据。

                    <br/>在适用情况下，您可通过联系隐私团队来行使上述权利；或者，在某些市场中设有在线工具时，您也可以使用此类在线工具来行使上述权利。我们将在适用法律规定的期限内，对您行使上述数据主体权利的申请做出响应。我们在提供所申请的信息之前，可酌情要求您证明自身身份，以确保仅向您本人披露您的个人数据。如您决定不向我们提供处理您的申请所需要的个人数据，那么我们可能无法恰当地处理您的申请。如您对我们处理申请的方式不满，或者认为我们有违反适用的数据保护法律的行为，则可向相应的监督主管部门（例如处所所在的市场的监督主管部门）投诉或提出索赔。

                    <br/>9.   您对接收营销推广信息的选择
                    <br/>您对是否接收我们的营销推广信息（比如说，我们可通过促销电邮等电子方式发送此类推广）享有决定权。在某些市场中，您需要在接收推广信息之前向我们提供许可。例如，在您注册成为新顾客或事业经营伙伴时，我们可能会出示一个显示有“接收促销电邮”的选择框供您勾选。在所有市场中，您均可随时选择不接收此类函件。若您不希望接收任何营销推广信息，或者不希望保留在您此前订阅项目的收件人名单上，或者不希望再接收其他任何营销推广信息，则请按照相关函件上的退订链接操作，也可联系隐私团队。

                    <br/>10.  隐私政策的变更
                    <br/>我们可能会不时更新本隐私政策。若有重大变更，我们将向您予以告知，告知方式包括在这里发布相应变更，或者通过我们通常与您沟通时使用的其他适当的渠道向您发出通知。除非另行指出，否则对本隐私政策的任何变更均视为在发布于本网站后立即生效。

                    <br/> 本隐私政策最近一次修订于2019年2月5日。
                </div>
            ),
            onOk() {},
        });
    }
    nextPage=()=>{
        this.props.history.push('/login/Improve_information')
    }
    render() {
        return (
            <div>
                <div className='BigBox'>
                   <div className='regHeader'>
                       <img src={require('../../assets/images/log.png')} alt=""/>
                       <span>欢迎注册</span>
                       <div>
                           已有账号？<Link to='/login/Login'>去登录</Link>
                       </div>
                   </div>
                    <div className='regBody'>
                        <form action="">
                            <div>手机号码</div>
                            <input type="text" placeholder='请输入手机号码'/>
                            <div>验证</div>
                            <input type="text" placeholder='验证码'/>
                            <img src={require('../../assets/images/verification.jpg')} alt=""/>
                            <span>换一张</span>
                            <div>手机短信验证</div>
                            <div>
                                <input type="text" placeholder='请输入手机验证码' className='phone'/>
                                <input type="button" value={this.state.content} className='btnPhone' onClick={this.changeCode}/>
                            </div>
                            <div>设置密码</div>
                            <input type="text" placeholder='密码长度为6-20位字符，必须包含字母、数字、下划线'/>
                            <div>确认密码</div>
                            <input type="text" placeholder='请再次确认密码'/>  <br/>
                            <div className='argue'>
                                <input type="checkbox" onClick={this.arugement} id='argue'/>
                                <div>同意《如新用户注册协议》</div>
                            </div>
                            <input type="button" value='取消' onClick={this.back}/>
                            <input type="submit" value='下一步' onClick={this.nextPage}/>
                        </form>
                    </div>
                </div>
            </div>
        )
    }
}

export default Register
